app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (director = 'aaaah' AND title != '#movie.title')
---
  def similar_movies
    @movie = Movie.find params[:id]